package lessons1;

/*
Способы программирования:
    1) Процедурный - задачи разбиваются на шаги и решаются шаг за шагом.
    2) Функциональный - все решения описываются при помощи функций.
    3) ООП - решение проблемы производится при помощи функций и структур данных, описанных в классах.
       Из каждого класса можно создать объект, у которого будет набор свойств и методов.
--------------------------------------------------------------------------------------------------------------------
Метод - отображение состаяния класса, это функция, операция .
 */

public class Method {
    public static void main(String[] args) {
        System.out.println("Welcome to the first lessons!!!");
        System.out.println("Hello...");

        System.out.print("Меня зовут: ");
        System.out.println("Максим");

        System.out.print("А ");
        System.out.println("а");
        System.out.print("Б ");
        System.out.println("б");
        System.out.print("Ц ");
        System.out.println("ц");
    }
}
